# Key Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
KeyBasedTreeEntry..::..Key Property
KeyBasedTreeEntry Class See Also
---
The key of this entry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string Key { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Key As String
	Get
```

Visual C++
---
```text
public:
property String^ Key {
	String^ get ();
}
```

# Remarks
This value will be used to do retrieval, sort and comparison. This value should not be empty.
# See Also
KeyBasedTreeEntry Class
Autodesk.Revit.DB Namespace